package com.lessons;

public class Homework12_4 {
    public static void main(String[] args) {
        getTask1();
    }


    /**
     4*) Вычислить чиcло PI с точность несколько знаков после запятой:
     a) ряд Лейбница:
     PI = (4/1) - (4/3) + (4/5) - (4/7) + (4/9) - (4/11) + (4/13) - (4/15) ...
     b) ряд Нилаканта:
     PI = 3 + 4/(2*3*4) - 4/(4*5*6) + 4/(6*7*8) - 4/(8*9*10) + 4/(10*11*12) - (4/(12*13*14) ...
     Определить какой из рядов дает необходимую точность при меньшем количестве итераций.
     */
    public static void getTask1() {

    }


}
